{
    "name": "SurajKumar Kadiyam Balaji",
    "typedItems": ["Hardware Engineer", "Verification Engineer", "Embedded Systems Designer", "Soc Design Engineer", "Analog Design Engineer", "Digital Design Engineer"],
    "mainRole": "Electrical & Computer Engineer",
    "summary": "With a solid foundation in Electrical and Electronics Engineering from Anna University, where I was a University Merit Scholar, I am currently pursuing an MS in Electrical and Computer Engineering at Northeastern University. My career progression from an Electrical Design Engineer at Tata Technologies, where I validated instrument clusters and reduced field failures by 20%, to a Teaching Assistant guiding graduate students, demonstrates my ability to apply engineering principles in both industry and academic settings. I possess a strong technical skill set in coding languages such as Python, Verilog, and C++, and I am proficient in software like Cadence, Matlab, and Synopsys. My projects, from designing a 32-bit ALU to simulating branch predictors, showcase my commitment to continuous learning and my capacity to deliver impactful results",
    "profileImage": "assets/img/about.jpg",
    "jobTitle": "VLSI Engineer & Hardware Designer.",
    "introText": "With expertise in Embedded systems, VLSI design, SoC architecture, and cutting-edge technologies, I thrive on crafting reliable and efficient solutions for diverse challenges.",
    "personalInfo": {
        "left": [
            { "label": "Birthday", "value": "20 April 2001" },
            { "label": "Phone", "value": "+1 (617)-602-7188" },
            { "label": "City", "value": "Boston, MA, USA" },
            {
                "label": "Hobbies",
                "value": "Photography, Reading tech blogs & Traveling"
            }
        ],
        "right": [
            { "label": "Age", "value": "23" },
            {
                "label": "Degree",
                "value": "Master's in Electrical and Computer Engineering"
            },
            { "label": "Email", "value": "kadiyambalaji.s@northeastern.edu" }
        ]
    },
    "closingText": "My academic journey and professional experience are underscored by impactful projects, ranging from embedded systems to benchmarking advanced processor architectures. Aiming to innovate and excel, I combine analytical skills with hands-on expertise to drive meaningful advancements in technology."
}
