{
    "name": "SurajKumar Kadiyam Balaji",
    "typedItems": ["Hardware Engineer", "Verification Engineer", "Embedded Systems Designer", "Soc Design Engineer", "Analog Design Engineer", "Digital Design Engineer"],
    "mainRole": "Electrical & Computer Engineer",
    "summary": "For me, engineering is about solving problems and building the next generation of technology. At Tata Technologies, I was part of a team that built reliable electronic systems for commercial vehicles, using tools like CAN and I2C to validate and refine performance. This professional experience was the launching pad for my advanced studies at Northeastern University, where my focus shifted to the cutting-edge of VLSI and solid-state devices. I applied this knowledge to real-world challenges, from the ground-up design of a 32-bit ALU using Cadence, to the in-depth analysis of FinFET technology for analog and RF applications. My most rewarding work, however, came from a passion project: designing a smart wearable for pulmonary fibrosis patients. This work, which I've had the honor to publish, allowed me to architect a complete hardware solution, from the microcontroller and Wi-Fi modules to the custom analog front-end. I am an engineer who is not only proficient in the tools of the trade but is driven to create meaningful technology that makes a difference",
    "profileImage": "assets/img/about.jpg",
    "jobTitle": "VLSI Engineer & Hardware Designer.",
    "introText": "I am a driven VLSI Engineer and Hardware Designer with a passion for building reliable and efficient solutions. My expertise in Embedded systems, design verification and validation, Digital and Analog Design, and VLSI design allows me to tackle diverse challenges and drive innovation.",
    "personalInfo": {
        "left": [
            { "label": "Birthday", "value": "20 April 2001" },
            { "label": "Phone", "value": "+1 (617)-602-7188" },
            { "label": "City", "value": "Boston, MA, USA" },
            {
                "label": "Hobbies",
                "value": "Photography, Reading tech blogs & Traveling"
            }
        ],
        "right": [
            { "label": "Age", "value": "23" },
            {
                "label": "Degree",
                "value": "Master's in Electrical and Computer Engineering"
            },
            { "label": "Email", "value": "kadiyambalaji.s@northeastern.edu" }
        ]
    },
    "closingText": "My academic journey and professional experience are underscored by impactful projects, ranging from embedded systems to benchmarking advanced processor architectures. Aiming to innovate and excel, I combine analytical skills with hands-on expertise to drive meaningful advancements in technology."
}
