{
    "title": "Experience",
    "description": "Showcasing practical expertise and academic knowledge in Electrical and Computer Engineering, with a focus on advancing skills in hardware design, embedded systems, and automotive electronics.",
    "items": [
        {
            "role": "Teaching Assistant",
            "date": "Jan 2025 - Present",
            "company": "Northeastern University - Fundamentals of Electronics",
            "tasks": [
                "Guided graduate students in Conducting Electronics experiments using lab equipment such as Curve Tracer, Vector Network Analyser.",
                "Taught weekly circuit lab sessions, guiding students in simulation and enhancing presentation skills, while providing constructive feedback to 50+ students to improve performance."
            ]
        },
        {
            "role": "Electrical Design Engineer",
            "date": "Jan 2023 - June 2024",
            "company": "Tata Motors, Pune",
            "tasks": [
                "Tested and validated instrument clusters using CAN, SPI, UART, and I2C tools to meet performance and safety specs, reducing field failures by 20% through simulation, diagnostic testing, and system validation.",
                "Performed signal integrity checks and EMI/EMC compliance testing using STM32 IDE, oscilloscope, and logic analyzers.",
                "Collaborated with cross-functional teams to troubleshoot analog front-end interfaces, reducing design cycle time.",
                "Collaborated with electrical and mechanical teams to resolve system integration issues and Cut fault diagnosis time by 30% using STM32 IDE, oscilloscope and logic analyser tools."
            ]
        },
        {
            "role": "Embedded Engineer Intern",
            "date": "July 2022 - Dec 2022",
            "company": "Skill-Lync E-learning Company, Chennai",
            "tasks": [
                "Developed embedded systems using Embedded C and AVR bare-metal programming.",
                "Simulated and analyzed analog and RF circuits for noise and impedance optimization.",
                "Designed PCBs with RF matching networks and worked on SoC architecture to optimize system-level performance."
            ]
        }
    ]
}
